output/posts/2017-08-09-adding-the-time-of-a-journal-entry-as-a-property.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Adding the time of a journal entry as a property | The journal that counts</title>
<link href="../assets/css/bootstrap.min.css" rel="stylesheet" type="text/css">
<link href="../assets/css/html4css1.css" rel="stylesheet" type="text/css">
<link href="../assets/css/nikola_rst.css" rel="stylesheet" type="text/css">
<link href="../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../assets/css/colorbox.css" rel="stylesheet" type="text/css">
<link href="../assets/css/theme.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../rss.xml">
<link rel="canonical" href="https://example.com/posts/2017-08-09-adding-the-time-of-a-journal-entry-as-a-property.html">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Pieter Swinkels">
<link rel="prev" href="2017-08-09-finding-journal-entries-from-the-org-mode-agenda-buffer.html" title="Finding journal entries from the org-mode Agenda buffer" type="text/html">
<link rel="next" href="2017-08-09-summarizing-the-clocking-time-in-a-journal-entry.html" title="Summarizing the clocking time in a journal entry" type="text/html">
<meta property="og:site_name" content="The journal that counts">
<meta property="og:title" content="Adding the time of a journal entry as a property">
<meta property="og:url" content="https://example.com/posts/2017-08-09-adding-the-time-of-a-journal-entry-as-a-property.html">
<meta property="og:description" content="Adding the time of a journal entry as a property


By default org-journal prepends each title of a journal entry with time the
entry was started. For example, the current entry was originally titled

">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-08-09T16:01:00+02:00">
<meta property="article:tag" content="emacs">
<meta property="article:tag" content="orgmode">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">The journal that counts</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../archive.html">Archive</a>
                </li>
<li>
<a href="../categories/index.html">Tags</a>
                </li>
<li>
<a href="../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="2017-08-09-adding-the-time-of-a-journal-entry-as-a-property.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="#" class="u-url">Adding the time of a journal entry as a property</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    <a href="../authors/pieter-swinkels.html">Pieter Swinkels</a>
            </span></p>
            <p class="dateline"><a href="#" rel="bookmark"><time class="published dt-published" datetime="2017-08-09T16:01:00+02:00" itemprop="datePublished" title="2017-08-09 16:01">2017-08-09 16:01</time></a></p>
            
        <p class="sourceline"><a href="2017-08-09-adding-the-time-of-a-journal-entry-as-a-property.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Adding the time of a journal entry as a property</h2>
<div class="outline-text-2" id="text-1">
<p>
By default org-journal prepends each title of a journal entry with time the
entry was started. For example, the current entry was originally titled
</p>
<pre class="example">
16:01 Add the time of a journal entry as a property
</pre>
<p>
I prefer to not have the start time in the title. The following snippet takes
care of that:
</p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="nf">setq</span> <span class="nv">org-journal-time-format</span> <span class="s">""</span><span class="p">)</span>
</pre></div>

<p>
On the other hand, I do not want to lose that information completely. So I
implemented a hook to automatically enter the time in a property drawer of the
newly created entry:
</p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="nf">defun</span> <span class="nv">add-time-as-orgmode-property</span><span class="p">()</span>
  <span class="p">(</span><span class="nf">progn</span>
    <span class="p">(</span><span class="nf">org-insert-property-drawer</span><span class="p">)</span>
    <span class="p">(</span><span class="nf">org-entry-put</span> <span class="p">(</span><span class="nf">point</span><span class="p">)</span> <span class="s">"Time"</span> <span class="p">(</span><span class="nf">format-time-string</span> <span class="s">"%H:%M"</span><span class="p">))</span>
    <span class="p">(</span><span class="nf">re-search-backward</span> <span class="s">"^*"</span><span class="p">)</span>
    <span class="p">(</span><span class="nf">end-of-line</span><span class="p">)</span>
    <span class="p">)</span>
<span class="p">)</span>

<span class="p">(</span><span class="nf">add-hook</span> <span class="ss">'org-journal-after-entry-create-hook</span> <span class="ss">'add-time-as-orgmode-property</span><span class="p">)</span>
</pre></div>
<p>
With this change, the current entry starts as follows
</p>
<pre class="example">
Add the time of a journal entry as a property
:PROPERTIES:
:Time:     16:01
:END:
</pre>
<p>
Note that I left out the '*' symbols that start the heading. If I add them,
org-mode takes that for an actual heading, even if it is inside an example.
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../categories/emacs.html" rel="tag">emacs</a></li>
            <li><a class="tag p-category" href="../categories/orgmode.html" rel="tag">orgmode</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="2017-08-09-finding-journal-entries-from-the-org-mode-agenda-buffer.html" rel="prev" title="Finding journal entries from the org-mode Agenda buffer">Previous post</a>
            </li>
            <li class="next">
                <a href="2017-08-09-summarizing-the-clocking-time-in-a-journal-entry.html" rel="next" title="Summarizing the clocking time in a journal entry">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:swinkels.pieter@yahoo.com">Pieter Swinkels</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../assets/js/jquery.min.js"></script><script src="../assets/js/bootstrap.min.js"></script><script src="../assets/js/moment-with-locales.min.js"></script><script src="../assets/js/fancydates.js"></script><script src="../assets/js/jquery.colorbox-min.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
